kubelet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-26 Tue 21:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>kubelet 源码阅读(一)</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
<link rel="stylesheet" type="text/css" href="https://unpkg.com/gitalk/dist/gitalk.css"/></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">kubelet 源码阅读(一)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org289cdd4">1. 前言</a>
<ul>
<li><a href="#orgb9ea554">1.1. Kubelet</a></li>
</ul>
</li>
<li><a href="#orgc974f72">2. Kubelet 主循环</a>
<ul>
<li><a href="#org516cdc1">2.1. <span class="todo TODO">TODO</span> 监听api server的变更</a></li>
<li><a href="#org635d197">2.2. <span class="todo TODO">TODO</span> podWorkers 通过每个Pod一个goroutinue的方式处理Pod消息的更新</a></li>
<li><a href="#orgb899c97">2.3. <span class="todo TODO">TODO</span> 计算pod的变更跟需要的执行的动作</a></li>
</ul>
</li>
<li><a href="#orgbf72d7a">3. ProbeManager 的作用与实现</a></li>
<li><a href="#org894304c">4. ImageManager 的作用与实现</a></li>
<li><a href="#org37fe9dd">5. VolumeManager 的作用与实现</a></li>
<li><a href="#org038073a">6. 其他一些简单goroutinue的工作</a></li>
<li><a href="#orgd521b98">7. StatusManager 的作用与实现</a></li>
</ul>
</div>
</div>

<div id="outline-container-org289cdd4" class="outline-2">
<h2 id="org289cdd4"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
一直在使用k8s，但是也一直没有看过k8s的源码，一来是因为一直都是使用的状态，有问题就呼叫容器组；二来是觉得项目比较大，会耗费很多时间。目前换了个比较不大忙的工作，所以就想着把这块内容补起来，起码得把k8s几大组件都简单看一遍。
</p>
</div>

<div id="outline-container-orgb9ea554" class="outline-3">
<h3 id="orgb9ea554"><span class="section-number-3">1.1</span> Kubelet</h3>
<div class="outline-text-3" id="text-1-1">
<p>
kubelet 就个人理解来说，主要作用有两个：
</p>
<ul class="org-ul">
<li>上报节点数据</li>
<li>保持Pod的状态跟api server中声明的一样。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc974f72" class="outline-2">
<h2 id="orgc974f72"><span class="section-number-2">2</span> Kubelet 主循环</h2>
<div class="outline-text-2" id="text-2">
<p>
kubelet 主流程如下:
</p>
<ul class="org-ul">
<li>从api server(主要是api server)中获取更新的数据</li>
<li>podWorkers 每个Pod开启一个goroutinue，处理pod的更新</li>
<li>删除Pod
<ul class="org-ul">
<li>执行删除前的Hook</li>
<li>停止podWorkers的goroutinue</li>
<li>遍历pod里的容器，对每个容器执行删除操作</li>
</ul></li>
<li>更新Pod
<ul class="org-ul">
<li>计算Pod的状态</li>
<li>等待volume挂载完成</li>
<li>调用kubeGenericRuntimeManager的SyncPod处理
<ul class="org-ul">
<li>调用podSandboxChanged计算应该如何处理的容器跟pod</li>
<li>调用CRI接口进行处理</li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org516cdc1" class="outline-3">
<h3 id="org516cdc1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> 监听api server的变更</h3>
<div class="outline-text-3" id="text-2-1">
<p>
kubelet会监听node上的pod资源的变更，然后合并多个源的变更. 代码如下:
</p>
<div class="org-src-container">
<pre class="src src-go">func NewSourceApiserver(c clientset.Interface, nodeName types.NodeName, updates chan&lt;- interface{}) {
	lw := cache.NewListWatchFromClient(c.CoreV1().RESTClient(), "pods", metav1.NamespaceAll, fields.OneTermEqualSelector(api.PodHostField, string(nodeName)))
	newSourceApiserverFromLW(lw, updates)
}
func newSourceApiserverFromLW(lw cache.ListerWatcher, updates chan&lt;- interface{}) {
	send := func(objs []interface{}) {
		var pods []*v1.Pod
		for _, o := range objs {
			pods = append(pods, o.(*v1.Pod))
		}
		updates &lt;- kubetypes.PodUpdate{Pods: pods, Op: kubetypes.SET, Source: kubetypes.ApiserverSource}
	}
	r := cache.NewReflector(lw, &amp;v1.Pod{}, cache.NewUndeltaStore(send, cache.MetaNamespaceKeyFunc), 0)
	go r.Run(wait.NeverStop)
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go">func (s *podStorage) Merge(source string, change interface{}) error {
	s.updateLock.Lock()
	defer s.updateLock.Unlock()

	seenBefore := s.sourcesSeen.Has(source)
	adds, updates, deletes, removes, reconciles := s.merge(source, change)
	firstSet := !seenBefore &amp;&amp; s.sourcesSeen.Has(source)

	// deliver update notifications
	switch s.mode {
	case PodConfigNotificationIncremental:
		if len(removes.Pods) &gt; 0 {
			s.updates &lt;- *removes
		}
		if len(adds.Pods) &gt; 0 {
			s.updates &lt;- *adds
		}
		if len(updates.Pods) &gt; 0 {
			s.updates &lt;- *updates
		}
		if len(deletes.Pods) &gt; 0 {
			s.updates &lt;- *deletes
		}
		if firstSet &amp;&amp; len(adds.Pods) == 0 &amp;&amp; len(updates.Pods) == 0 &amp;&amp; len(deletes.Pods) == 0 {
			// Send an empty update when first seeing the source and there are
			// no ADD or UPDATE or DELETE pods from the source. This signals kubelet that
			// the source is ready.
			s.updates &lt;- *adds
		}
		// Only add reconcile support here, because kubelet doesn't support Snapshot update now.
		if len(reconciles.Pods) &gt; 0 {
			s.updates &lt;- *reconciles
		}

	case PodConfigNotificationSnapshotAndUpdates:
		if len(removes.Pods) &gt; 0 || len(adds.Pods) &gt; 0 || firstSet {
			s.updates &lt;- kubetypes.PodUpdate{Pods: s.MergedState().([]*v1.Pod), Op: kubetypes.SET, Source: source}
		}
		if len(updates.Pods) &gt; 0 {
			s.updates &lt;- *updates
		}
		if len(deletes.Pods) &gt; 0 {
			s.updates &lt;- *deletes
		}

	case PodConfigNotificationSnapshot:
		if len(updates.Pods) &gt; 0 || len(deletes.Pods) &gt; 0 || len(adds.Pods) &gt; 0 || len(removes.Pods) &gt; 0 || firstSet {
			s.updates &lt;- kubetypes.PodUpdate{Pods: s.MergedState().([]*v1.Pod), Op: kubetypes.SET, Source: source}
		}

	case PodConfigNotificationUnknown:
		fallthrough
	default:
		panic(fmt.Sprintf("unsupported PodConfigNotificationMode: %#v", s.mode))
	}

	return nil
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go">type SyncHandler interface {
	HandlePodAdditions(pods []*v1.Pod)
	HandlePodUpdates(pods []*v1.Pod)
	HandlePodRemoves(pods []*v1.Pod)
	HandlePodReconcile(pods []*v1.Pod)
	HandlePodSyncs(pods []*v1.Pod)
	HandlePodCleanups() error
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org635d197" class="outline-3">
<h3 id="org635d197"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> podWorkers 通过每个Pod一个goroutinue的方式处理Pod消息的更新</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-go">func (p *podWorkers) UpdatePod(options *UpdatePodOptions) {
	pod := options.Pod
	uid := pod.UID
	var podUpdates chan UpdatePodOptions
	var exists bool

	p.podLock.Lock()
	defer p.podLock.Unlock()
	if podUpdates, exists = p.podUpdates[uid]; !exists {
		podUpdates = make(chan UpdatePodOptions, 1)
		p.podUpdates[uid] = podUpdates
		go func() {
			defer runtime.HandleCrash()
			p.managePodLoop(podUpdates)
		}()
	}
	if !p.isWorking[pod.UID] {
		p.isWorking[pod.UID] = true
		podUpdates &lt;- *options
	} else {
		update, found := p.lastUndeliveredWorkUpdate[pod.UID]
		if !found || update.UpdateType != kubetypes.SyncPodKill {
			p.lastUndeliveredWorkUpdate[pod.UID] = *options
		}
	}
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb899c97" class="outline-3">
<h3 id="orgb899c97"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> 计算pod的变更跟需要的执行的动作</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-go">// SyncPod syncs the running pod into the desired pod by executing following steps:
//
//  1. Compute sandbox and container changes.
//  2. Kill pod sandbox if necessary.
//  3. Kill any containers that should not be running.
//  4. Create sandbox if necessary.
//  5. Create ephemeral containers.
//  6. Create init containers.
//  7. Create normal containers.
func (m *kubeGenericRuntimeManager) SyncPod(pod *v1.Pod, podStatus *kubecontainer.PodStatus, pullSecrets []v1.Secret, backOff *flowcontrol.Backoff) (result kubecontainer.PodSyncResult) {
	// Step 1: Compute sandbox and container changes.
	podContainerChanges := m.computePodActions(pod, podStatus)
	klog.V(3).Infof("computePodActions got %+v for pod %q", podContainerChanges, format.Pod(pod))
	if podContainerChanges.CreateSandbox {
		ref, err := ref.GetReference(legacyscheme.Scheme, pod)
		if err != nil {
			klog.Errorf("Couldn't make a ref to pod %q: '%v'", format.Pod(pod), err)
		}
		if podContainerChanges.SandboxID != "" {
			m.recorder.Eventf(ref, v1.EventTypeNormal, events.SandboxChanged, "Pod sandbox changed, it will be killed and re-created.")
		} else {
			klog.V(4).Infof("SyncPod received new pod %q, will create a sandbox for it", format.Pod(pod))
		}
	}
//省略
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbf72d7a" class="outline-2">
<h2 id="orgbf72d7a"><span class="section-number-2">3</span> ProbeManager 的作用与实现</h2>
<div class="outline-text-2" id="text-3">
<p>
ProbeManager 作用是用于执行pod的探针。每个探针都开启一个goroutinue周期执行。并把结果设置到status中。
</p>
</div>
</div>
<div id="outline-container-org894304c" class="outline-2">
<h2 id="org894304c"><span class="section-number-2">4</span> ImageManager 的作用与实现</h2>
<div class="outline-text-2" id="text-4">
<p>
ImageManager 用于管理主机上的image的生命周期。
</p>
<div class="org-src-container">
<pre class="src src-go">type ImageGCManager interface {
       GarbageCollect() error
       Start()
       GetImageList() ([]container.Image, error)
       DeleteUnusedImages() error
}
</pre>
</div>
<ul class="org-ul">
<li>Start 函数每五分钟检测本机是否有新的镜像，更新镜像使用时间。</li>
<li>Start 函数每30s获取本机的所有镜像，更新到自己的缓存中。</li>
<li>GetImageList 从缓存中获取本地的所有镜像。</li>
<li>GarbageCollect 获取本机的镜像使用情况，如果使用量达到一定的水位，则会尝试删除未使用的镜像。(如果镜像存在时间过短也不会删除，防止刚拉取的镜像还未使用就被删除，这个时间默认是2分钟)</li>
<li>DeleteUnusedImages 删除未使用的镜像，回收磁盘空间，跟 GarbageCollect 不同的 GC 是当镜像磁盘使用率达到一定空间后才会触发，而且只回收一定的空间(满足空间未达到高水位), 而此函数会尽可能的回收所有空间。</li>
</ul>
</div>
</div>

<div id="outline-container-org37fe9dd" class="outline-2">
<h2 id="org37fe9dd"><span class="section-number-2">5</span> VolumeManager 的作用与实现</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-go">type VolumeManager interface {
	Run(sourcesReady config.SourcesReady, stopCh &lt;-chan struct{})
	WaitForAttachAndMount(pod *v1.Pod) error
	GetMountedVolumesForPod(podName types.UniquePodName) container.VolumeMap
	GetExtraSupplementalGroupsForPod(pod *v1.Pod) []int64
	GetVolumesInUse() []v1.UniqueVolumeName
	VolumeIsAttached(volumeName v1.UniqueVolumeName) bool
	MarkVolumesAsReportedInUse(volumesReportedAsInUse []v1.UniqueVolumeName)
}
</pre>
</div>
<ul class="org-ul">
<li>Run 会启动desiredStateOfWorldPopulator 和 reconciler 两个goroutinue。</li>
<li>desiredStateOfWorldPopulator 从PodManager中获取Pods，计算最终的数据，存放在desiredStateOfWorld.</li>
<li>reconciler 通过desiredStateOfWorld 把现在的状态慢慢的迁移到期望的状态, reconciler 主要执行以下三个操作.</li>
</ul>
<div class="org-src-container">
<pre class="src src-go">func (rc *reconciler) reconcile() {
	// Unmounts are triggered before mounts so that a volume that was
	// referenced by a pod that was deleted and is now referenced by another
	// pod is unmounted from the first pod before being mounted to the new
	// pod.
	rc.unmountVolumes()

	// Next we mount required volumes. This function could also trigger
	// attach if kubelet is responsible for attaching volumes.
	// If underlying PVC was resized while in-use then this function also handles volume
	// resizing.
	rc.mountAttachVolumes()

	// Ensure devices that should be detached/unmounted are detached/unmounted.
	rc.unmountDetachDevices()
}
</pre>
</div>
<ul class="org-ul">
<li>WaitForAttachAndMount 会检查pod是否达到期望状态，会等待2分钟。</li>
<li>GetMountedVolumesForPod 获取当前pod的卷的实际状态。</li>
<li>GetVolumesInUse 获取实际状态和期望状态的在使用的卷。</li>
<li>VolumeIsAttached 如果volumeName在实际状态中，则表示在已经attach</li>
</ul>
</div>
</div>
<div id="outline-container-org038073a" class="outline-2">
<h2 id="org038073a"><span class="section-number-2">6</span> 其他一些简单goroutinue的工作</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>同步节点状态</li>
<li>同步租约</li>
<li>更新容器运行时状态</li>
<li>每秒执行PodKilling</li>
</ul>
</div>
</div>
<div id="outline-container-orgd521b98" class="outline-2">
<h2 id="orgd521b98"><span class="section-number-2">7</span> StatusManager 的作用与实现</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-go">type Manager interface {
	PodStatusProvider
	Start()
	SetPodStatus(pod *v1.Pod, status v1.PodStatus)
	SetContainerReadiness(podUID types.UID, containerID kubecontainer.ContainerID, ready bool)
	SetContainerStartup(podUID types.UID, containerID kubecontainer.ContainerID, started bool)
	TerminatePod(pod *v1.Pod)
	RemoveOrphanedStatuses(podUIDs map[types.UID]bool)
}
</pre>
</div>
<ul class="org-ul">
<li>Start 启动一个goroutinue 定时同步Pod的状态到api server</li>
<li>SetPodStatus 在监听到pod状态改变的时候更新Pod的状态</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="gitalk" /> <script> var gitalk = new Gitalk({
  clientID: 'f30e66bb5ab9089aa742',
  clientSecret: '5d256d445447bd4db16540c2aab0e0884218ed12',
  repo: 'guidao.github.io',
  owner: 'guidao',
  admin: ['guidao'],
  id: location.pathname,      // Ensure uniqueness and length less than 50
  distractionFreeMode: false  // Facebook-like distraction free mode
})
gitalk.render('gitalk') </script>
</div>
</body>
</html>
